"CIAdditionCompositing" = "加算";
"CIAffineClamp" = "アフィン（クランプ）";
"CIAffineTile" = "アフィン（タイル）";
"CIAffineTransform" = "アフィン変換";
"CIBarsSwipeTransition"="バーによるスワイプ遷移";
"CIBlendWithMask" = "マスクを使用してブレンド";
"CIBloom" = "曇り";
"CIBoxBlur"="ボックスブラー";
"CIBumpDistortion" = "バンプ（凸凹）";
"CIBumpDistortionLinear"="線形バンプ歪み";
"CICMYKHalftone" = "CMYK ハーフトーン";
"CICheckerboardGenerator" = "チェッカーボード";
"CICircleSplashDistortion" = "丸い飛沫（歪み）";
"CICircularScreen" = "円";
"CICircularWrap" = "循環ラップ（歪み）";
"CIColorControls" = "カラーコントロール";
"CIColorCube" = "カラー立方体";
"CIColorInvert" = "色の反転";
"CIColorMap" = "カラーマップ";
"CIColorMatrix" = "カラーマトリクス";
"CIColorMonochrome" = "モノクロ化";
"CIColorPosterize" = "ポスタライズ";
"CIComicEffect" = "漫画調エフェクト";
"CIConstantColorGenerator" = "コンスタントカラー";
"CICopyMachineTransition" = "コピーマシン";
"CICrop" = "切り取り";
"CICrystallize" = "結晶化";
"CIDiscBlur"="ディスクブラー";
"CIDisintegrateWithMaskTransition" = "マスクを使用して分解";
"CIDisplacementDistortion" = "置き換え";
"CIDissolveTransition" = "ディゾルブ";
"CIDotScreen" = "点";
"CIEdges" = "エッジ";
"CIEdgeWork" = "エッジワーク";
"CIEightfoldReflectedTile"="8 方向反射によるタイリング";
"CIExposureAdjust" = "露出調整";
"CIFalseColor" = "偽色";
"CIFastBoxBlur" = "ボックスブラー（高速）";
"CIFastDiscBlur" = "ディスクブラー（高速）";
"CIFlashTransition" = "ストロボ";
"CIFourfoldReflectedTile"="4 方向反射によるタイリング";
"CIFourfoldRotatedTile"="4 方向回転によるタイリング";
"CIFourfoldTranslatedTile"="4 方向変形によるタイリング";
"CIGammaAdjust" = "ガンマ調整";
"CIGaussianBlur" = "ガウスブラー";
"CIGaussianGradient" = "ガウス";
"CIGlassDistortion" = "ガラス";
"CIGlassLozenge" = "ガラス（ひし形）";
"CIGlideReflectedTile"="グレイド反射によるタイリング";
"CIGloom" = "暗影";
"CIHatchedScreen" = "平行線";
"CIHeightFieldFromMask" = "マスクからの高さフィールド";
"CIHexagonalPixellate"="6 角モザイク";
"CIHoleDistortion" = "穴（歪み）";
"CIHueAdjust" = "色相調整";
"CIKaleidoscope" = "万華鏡";
"CILanczosScaleTransform" = "ランチョススケール変換";
"CILenticularHaloGenerator" = "レンズハロー";
"CILineOverlay" = "輪郭抽出";
"CILineScreen" = "線";
"CILinearGradient" = "線形";
"CIMaskToAlpha" = "アルファにマスク";
"CIMaximumCompositing" = "最大";
"CIMedianFilter" = "中央";
"CIMinimumCompositing" = "最小";
"CIModTransition" = "モッド";
"CIMotionBlur" = "モーションブラー";
"CIMultiplyCompositing" = "多重化";
"CINoiseReduction" = "ノイズの除去";
"CIOpTile" = "オプ";
"CIPageCurlTransition" = "ページめくり";
"CIParallelogramTile" = "平行四辺形";
"CIPerspectiveTile" = "パースペクティブ";
"CIPerspectiveTransform" = "パースペクティブ";
"CIPinchDistortion" = "ピンチ（歪み）";
"CIPixellate" = "ピクセレート";
"CIPointillize" = "点に変換";
"CIRadialGradient" = "放射状";
"CIRandomGenerator" = "ランダムジェネレータ";
"CIRippleTransition" = "波紋";
"CISepiaTone" = "セピア調";
"CIShadedMaterial" = "影付きマテリアル";
"CISharpenLuminance" = "輝度を上げる";
"CISixfoldReflectedTile"="6 方向反射によるタイリング";
"CISixfoldRotatedTile"="6 方向回転によるタイリング";
"CISourceAtopCompositing" = "ソースアトップ";
"CISourceInCompositing" = "ソースイン";
"CISourceOutCompositing" = "ソースアウト";
"CISourceOverCompositing" = "ソースオーバー";
"CISpotColor" = "スポット色置換";
"CISpotLight" = "スポットライト";
"CIStarShineGenerator" = "スターシャイン";
"CIStripesGenerator" = "ストライプ";
"CISunbeamsGenerator" = "サンビーム";
"CISwipeTransition" = "スワイプ";
"CITorusLensDistortion" = "円環体レンズ";
"CITriangleTile" = "三角形";
"CITwelvefoldReflectedTile"="12 方向反射によるタイリング";
"CITwirlDistortion" = "らせん";
"CIUnsharpMask" = "アンシャープマスク";
"CIVortexDistortion" = "渦巻き";
"CIWhitePointAdjust" = "ホワイトポイント調整";
"CIZoomBlur" = "ズームブラー";
"CIColorBlendMode" = "カラー・ブレンド・モード";
"CIColorBurnBlendMode" = "カラー焼き込みブレンドモード";
"CIColorDodgeBlendMode" = "覆い焼きカラー・ブレンド・モード";
"CIDarkenBlendMode" = "比較（暗）ブレンドモード";
"CIDifferenceBlendMode" = "差の絶対値ブレンドモード";
"CIExclusionBlendMode" = "除外ブレンドモード";
"CIHardLightBlendMode" = "ハード・ライト・ブレンド・モード";
"CIHueBlendMode" = "色相ブレンドモード";
"CILightenBlendMode" = "比較（明）ブレンドモード";
"CILuminosityBlendMode" = "輝度ブレンドモード";
"CIMultiplyBlendMode" = "乗算ブレンドモード";
"CIOverlayBlendMode" = "オーバーレイ・ブレンド・モード";
"CISaturationBlendMode" = "彩度ブレンドモード";
"CIScreenBlendMode" = "スクリーン・ブレンド・モード";
"CISoftLightBlendMode" = "ソフト・ライト・ブレンド・モード";
"CIAreaHistogram" = "領域のヒストグラム";
"CIAreaMaximum" = "領域の最大値";
"CIAreaMinimum" = "領域の最小値";
"CIAreaMaximumAlpha" = "領域の最大アルファ値";
"CIAreaMinimumAlpha" = "領域の最小アルファ値";
"CIAreaAverage" = "領域の平均値";
"CIRowAverage" = "行の平均値";
"CIColumnAverage" = "列の平均値";
"CIMinimumComponent" = "最小成分値";
"CIMaximumComponent" = "最大成分値";
